In [7]:
import pandas as pd

In [8]:
a={'점수1':[10,20,30],'점수2':[20,40,60]}

In [9]:
df1=pd.DataFrame(a)
df1

   점수1  점수2
0   10   20
1   20   40
2   30   60

In [10]:
b={'점수1':[100,200,300],'점수3':[200,400,600]}
df2 = pd.DataFrame(b)
df2

   점수1  점수3
0  100  200
1  200  400
2  300  600

In [11]:
df3=df1+df2
df3

   점수1  점수2  점수3
0  110  NaN  NaN
1  220  NaN  NaN
2  330  NaN  NaN

In [12]:
df4=df1.add(df2, fill_value=0)
df4

   점수1   점수2    점수3
0  110  20.0  200.0
1  220  40.0  400.0
2  330  60.0  600.0

In [13]:
df5=df1.sub(df2, fill_value=0)
df5

   점수1   점수2    점수3
0  -90  20.0 -200.0
1 -180  40.0 -400.0
2 -270  60.0 -600.0

In [14]:
df6=df1.mul(df2,fill_value=1)
df6

    점수1   점수2    점수3
0  1000  20.0  200.0
1  4000  40.0  400.0
2  9000  60.0  600.0

In [15]:
df7=df1.div(df2,fill_value=1)
df7

   점수1   점수2       점수3
0  0.1  20.0  0.005000
1  0.1  40.0  0.002500
2  0.1  60.0  0.001667